#1. Elabore um BD (nome e dados a seu critério) que:
- Colete dados de um arquivo txt e;
- Insira em uma tabela do seu banco de dados.
- Sua tabela deve ter três campos ou mais.
- Seu código deve fazer as operações de CRUD e;
- Imprima os resultados.

In [ ]:
# Importanto Sqlite no Colab
import sqlite3 as db

In [ ]:
#Conectando ao banco de dados e criando as tabelas:
data = db.connect('my_database')
cursor = data.cursor()
cursor.execute("CREATE TABLE IF NOT EXISTS tbl_alunos (nome text, rg text, cpf text, data_nasc date)")
data.commit()

In [ ]:
# Abrindo o arquivo e conferindo se existe dados
with open("arquivo.txt", "r") as arquivo:
  arq = arquivo.readlines()

for line in arq:
    info = line.strip().split(',')
    print(info, type(info))

['Jefferson Pedro', '12.345.678-9', '123.456.789-09', '25-05-1993', ''] <class 'list'>
['Anna Thays', '12.345.678-9', '123.456.789-09', '03-05-1994', ''] <class 'list'>
['Simone Gamastrix', '12.345.678-9', '123.456.789-09', '12-08-2000', ''] <class 'list'>
['Asdrubaldo Corvaltino', ' 12.345.678-9', '123.456.789-09', '02-01-1980'] <class 'list'>

In [ ]:
# Coletando dados de um arquivo txt (seguir as orientações abaixo):
with open("arquivo.txt", "r") as arquivo:
  arq = arquivo.readlines()

# Loop para inserir os dados na tabela
for line in arq:
    info = line.strip().split(',')

    nome = info[0].strip()
    rg = info[1].strip()
    cpf = info[2].strip()
    data_nasc = info[3].strip()

    # Comando SQL para inserir dados com parâmetros
    comando_sql = "INSERT INTO tbl_alunos (nome, rg, cpf, data_nasc) VALUES (?, ?, ?, ?)"

    # Valores a serem inseridos
    valores = (nome, rg, cpf, data_nasc)

    # Comando SQL para inserção
    cursor.execute(comando_sql, valores)

data.commit()

In [ ]:
# Comando SQL de consulta
read_db = cursor.execute('SELECT * FROM tbl_alunos').fetchall()
for line in read_db:
  print(line)

('Jefferson Pedro', '12.345.678-9', '123.456.789-09', '25-05-1993')
('Anna Thays', '12.345.678-9', '123.456.789-09', '03-05-1994')
('Simone Gama', '12.345.678-9', '123.456.789-09', '12-08-2000')

In [ ]:
# Comando SQL de atualização
update_db = cursor.execute('''
    UPDATE tbl_alunos
    SET nome = 'Simone Gama'
    WHERE nome = 'Simone Gamastrix';
    '''
)

data.commit()

#Conferindo os valores
read_db = cursor.execute('SELECT * FROM tbl_alunos').fetchall()
for line in read_db:
  print(line)

('Jefferson Pedro', '12.345.678-9', '123.456.789-09', '25-05-1993')
('Anna Thays', '12.345.678-9', '123.456.789-09', '03-05-1994')
('Simone Gama', '12.345.678-9', '123.456.789-09', '12-08-2000')

In [ ]:
# Comando SQL de delete
delete_info = cursor.execute(
    '''
    DELETE from tbl_alunos
    WHERE Nome = 'Asdrubaldo Corvaltino'
    '''
).fetchall()

#Conferindo os valores
read_db = cursor.execute('SELECT * FROM tbl_alunos').fetchall()

for line in read_db:
  print(line)

('Jefferson Pedro', '12.345.678-9', '123.456.789-09', '25-05-1993')
('Anna Thays', '12.345.678-9', '123.456.789-09', '03-05-1994')
('Simone Gama', '12.345.678-9', '123.456.789-09', '12-08-2000')

# Orientações:

1- Dê dois cliques e cole o seguinte texto no txt:

Jefferson Pedro,12.345.678-9,123.456.789-09,25-05-1993,
Anna Thays,12.345.678-9,123.456.789-09,03-05-1994,
Simone Gamastrix,12.345.678-9,123.456.789-09,12-08-2000,
Asdrubaldo Corvaltino, 12.345.678-9,123.456.789-09,02-01-1980

2- Crie um txt com o nome "arquivo.txt" suba no seu projeto.

3- Se você estiver utilizando o Colab, não é necessário instalação do banco de dados SqLite.